export default function numberToGujaratiWords(num) {
  if (!Number(num)) return "શૂન્ય રૂપિયા પૂરાં";

  const gujWords1to99 = [
    "",
    "એક",
    "બે",
    "ત્રણ",
    "ચાર",
    "પાંચ",
    "છ",
    "સાત",
    "આઠ",
    "નવ",
    "દસ",
    "અગિયાર",
    "બાર",
    "તેર",
    "ચૌદ",
    "પંદર",
    "સોળ",
    "સત્તર",
    "અઢાર",
    "ઓગણીસ",
    "વીસ",
    "એકવીસ",
    "બાવીસ",
    "ત્રેવીસ",
    "ચોવીસ",
    "પચ્ચીસ",
    "છવ્વીસ",
    "સત્તાવીસ",
    "અઠ્ઠાવીસ",
    "ઓગણત્રીસ",
    "ત્રીસ",
    "એકત્રીસ",
    "બત્રીસ",
    "તેંત્રીસ",
    "ચોત્રીસ",
    "પાંત્રીસ",
    "છત્રીસ",
    "સાડત્રીસ",
    "આડત્રીસ",
    "ઓગણચાલીસ",
    "ચાલીસ",
    "એકતાલીસ",
    "બેતાલીસ",
    "તેતાલીસ",
    "ચુંમ્માલીસ",
    "પિસ્તાલીસ",
    "છેંતાલીસ",
    "સુડતાલીસ",
    "અડતાલીસ",
    "ઓગણપચાસ",
    "પચાસ",
    "એકાવન",
    "બાવન",
    "ત્રેપન",
    "ચોપન",
    "પંચાવન",
    "છપ્પન",
    "સત્તાવન",
    "અઠાવન",
    "ઓગણસાઠ",
    "સાઈઠ",
    "એકસઠ",
    "બાસઠ",
    "ત્રેસઠ",
    "ચોસઠ",
    "પાંસઠ",
    "છાસઠ",
    "સડસઠ",
    "અડસઠ",
    "ઓગણસિત્તેર",
    "સિત્તેર",
    "એકોતેર",
    "બોંતેર",
    "તોંતેર",
    "ચુંમોતેર",
    "પંચોતેર",
    "છોંતેર",
    "સીતોતેર",
    "ઇઠોતેર",
    "ઓગણએંસી",
    "એંસી",
    "એક્યાસી",
    "બ્યાસી",
    "ત્યાસી",
    "ચોરાસી",
    "પંચાસી",
    "છયાસી",
    "સત્યાસી",
    "અઠયાસી",
    "નેવ્યાસી",
    "નેવું",
    "એકાણું",
    "બાણું",
    "ત્રાણું",
    "ચોરાણું",
    "પંચાણું",
    "છન્નું",
    "સતાણું",
    "અઠાણું",
    "નવ્વાણું",
  ];

  function toWords(n) {
    if (n < 100) return gujWords1to99[n];
    if (n < 1000) {
      const hundredPart = Math.floor(n / 100);
      const rest = n % 100;
      return (
        gujWords1to99[hundredPart] +
        " સો" +
        (rest !== 0 ? " " + gujWords1to99[rest] : "")
      );
    }
    if (n < 100000) {
      const thousandPart = Math.floor(n / 1000);
      const rest = n % 1000;
      return (
        toWords(thousandPart) +
        " હજાર" +
        (rest !== 0 ? " " + toWords(rest) : "")
      );
    }
    if (n < 10000000) {
      const lakhPart = Math.floor(n / 100000);
      const rest = n % 100000;
      return (
        toWords(lakhPart) + " લાખ" + (rest !== 0 ? " " + toWords(rest) : "")
      );
    }
    const crorePart = Math.floor(n / 10000000);
    const rest = n % 10000000;
    return (
      toWords(crorePart) + " કરોડ" + (rest !== 0 ? " " + toWords(rest) : "")
    );
  }

  return toWords(Math.floor(num)) + " રૂપિયા પૂરાં";
}
